experiments/data/stats/ycsb_e_run3.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 14214
[OVERALL], Throughput(ops/sec), 70353.17292809905
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 45
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3165892781764457
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 45
[TOTAL_GC_TIME_%], Time(%), 0.3165892781764457
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3404800.0
[CLEANUP], MinLatency(us), 3403776
[CLEANUP], MaxLatency(us), 3405823
[CLEANUP], 50thPercentileLatency(us), 3405823
[CLEANUP], 95thPercentileLatency(us), 3405823
[CLEANUP], 99thPercentileLatency(us), 3405823
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.451195
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 20399
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 14
[INSERT], 99thPercentileLatency(us), 20
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 135122
[OVERALL], Throughput(ops/sec), 7400.719349920812
[TOTAL_GCS_G1_Young_Generation], Count, 70
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 975
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7215701366172792
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 70
[TOTAL_GC_TIME], Time(ms), 975
[TOTAL_GC_TIME_%], Time(%), 0.7215701366172792
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3125.0
[CLEANUP], MinLatency(us), 3124
[CLEANUP], MaxLatency(us), 3125
[CLEANUP], 50thPercentileLatency(us), 3125
[CLEANUP], 95thPercentileLatency(us), 3125
[CLEANUP], 99thPercentileLatency(us), 3125
[SCAN-LATENCY-PER-RECORD], Operations, 949988
[SCAN-LATENCY-PER-RECORD], AverageLatency(us), 2.694088767437062
[SCAN-LATENCY-PER-RECORD], MinLatency(us), 0
[SCAN-LATENCY-PER-RECORD], MaxLatency(us), 3575
[SCAN-LATENCY-PER-RECORD], 50thPercentileLatency(us), 2
[SCAN-LATENCY-PER-RECORD], 95thPercentileLatency(us), 5
[SCAN-LATENCY-PER-RECORD], 99thPercentileLatency(us), 13
[INSERT], Operations, 50012
[INSERT], AverageLatency(us), 15.962688954650885
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 917
[INSERT], 50thPercentileLatency(us), 15
[INSERT], 95thPercentileLatency(us), 22
[INSERT], 99thPercentileLatency(us), 30
[INSERT], Return=OK, 50012
[SCAN], Operations, 949988
[SCAN], AverageLatency(us), 136.86731306079656
[SCAN], MinLatency(us), 5
[SCAN], MaxLatency(us), 133887
[SCAN], 50thPercentileLatency(us), 129
[SCAN], 95thPercentileLatency(us), 256
[SCAN], 99thPercentileLatency(us), 335
[SCAN], Return=OK, 949988