experiments/data/stats/ycsb_e_run4.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 12132
[OVERALL], Throughput(ops/sec), 82426.64029014178
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 35
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2884932410154962
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 35
[TOTAL_GC_TIME_%], Time(%), 0.2884932410154962
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1818112.0
[CLEANUP], MinLatency(us), 1817600
[CLEANUP], MaxLatency(us), 1818623
[CLEANUP], 50thPercentileLatency(us), 1818623
[CLEANUP], 95thPercentileLatency(us), 1818623
[CLEANUP], 99thPercentileLatency(us), 1818623
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.011194
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 11095
[INSERT], 50thPercentileLatency(us), 8
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 19
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloade -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 129977
[OVERALL], Throughput(ops/sec), 7693.668879878748
[TOTAL_GCS_G1_Young_Generation], Count, 83
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 894
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.68781399786116
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 83
[TOTAL_GC_TIME], Time(ms), 894
[TOTAL_GC_TIME_%], Time(%), 0.68781399786116
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2973.0
[CLEANUP], MinLatency(us), 2972
[CLEANUP], MaxLatency(us), 2973
[CLEANUP], 50thPercentileLatency(us), 2973
[CLEANUP], 95thPercentileLatency(us), 2973
[CLEANUP], 99thPercentileLatency(us), 2973
[SCAN-LATENCY-PER-RECORD], Operations, 950024
[SCAN-LATENCY-PER-RECORD], AverageLatency(us), 2.5829263260717625
[SCAN-LATENCY-PER-RECORD], MinLatency(us), 0
[SCAN-LATENCY-PER-RECORD], MaxLatency(us), 2673
[SCAN-LATENCY-PER-RECORD], 50thPercentileLatency(us), 2
[SCAN-LATENCY-PER-RECORD], 95thPercentileLatency(us), 5
[SCAN-LATENCY-PER-RECORD], 99thPercentileLatency(us), 13
[INSERT], Operations, 49976
[INSERT], AverageLatency(us), 15.893989114775092
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 7539
[INSERT], 50thPercentileLatency(us), 15
[INSERT], 95thPercentileLatency(us), 22
[INSERT], 99thPercentileLatency(us), 28
[INSERT], Return=OK, 49976
[SCAN], Operations, 950024
[SCAN], AverageLatency(us), 131.69143937416317
[SCAN], MinLatency(us), 4
[SCAN], MaxLatency(us), 143359
[SCAN], 50thPercentileLatency(us), 125
[SCAN], 95thPercentileLatency(us), 244
[SCAN], 99thPercentileLatency(us), 315
[SCAN], Return=OK, 950024